package com.kh.common.code;

/**
 * @PackageName: com.uclass.common.code
 * @FileName : ErrorCode.java
 * @Date : 2020. 6. 16.
 * @프로그램 설명 : 
 * @author :하명도
 */
public enum ErrorCode {
	
	AM01("해당 페이지에 접근할 권한이 없습니다.","/member/login.do"),
	SM01("회원정보를 조회하는 도중 에러가 발생하였습니다."),
	SM02("이미 존재하는 아이디 입니다."),
	SM03("아이디나 비밀번호가 일치하지 않습니다.","/member/login.do"),
	SM04("이미 탈퇴한 회원입니다.","/member/login.do"),
	IM01("회원가입 도중 에러가 발생하였습니다."),
	UM01("회원정보를 수정하는 도중 에러가 발생하였습니다."),
	
	SB01("도서 검색 중 에러가 발생하였습니다."),
	SB02("검색 결과가 존재하지 않습니다."),
	
	SR01("대출정보를 불러오는 중 에러가 발생하였습니다."),	
	IR01("대출정보를 입력 하는 중 에러가 발생하였습니다."),
	IR02("도서 재고가 부족합니다."),
	IR03("이미 대출한 도서입니다."),
	IR04("연체중에는 대출이 불가능 합니다."),
	IR05("대출이 불가능한 기간입니다."),
	IR06("도서는 5권까지만 대출 가능합니다."),
	IR07("대출할 도서를 등록하지 않았습니다."),
	UR01("대출정보를 수정 하는 중 에러가 발생하였습니다."),
	UR02("연장 가능 횟수를 초과 하였습니다."),
	
	SB11("게시글 정보를 불러오는 중 에러가 발생하였습니다."),
	SB12("해당 게시글은 존재하지 않습니다."),
	IB11("게시판 정보를 입력 하는 중 에러가 발생하였습니다."),
	UB11("게시판 정보를 수정 하는 중 에러가 발생하였습니다."),
	DB11("게시판 정보를 삭제 하는 중 에러가 발생하였습니다."),
	
	SF01("파일 정보를 불러오는 중 에러가 발생하였습니다."),
	IF01("파일 정보를 입력 하는 중 에러가 발생하였습니다."),
	UF01("파일 정보를 수정 하는 중 에러가 발생하였습니다."),
	DF01("파일 정보를 삭제 하는 중 에러가 발생하였습니다."),
	
	SC01("장바구니 정보를 불러오던 중 에러가 발생하였습니다."),
	SC02("이미 장바구니에 등록한 도서입니다."),
	IC01("장바구니 정보를 입력 하는 중 에러가 발생하였습니다."),
	DC01("장바구니 정보를 삭제 하는 중 에러가 발생하였습니다."),
	
	M_ERROR_01("메일 발송 도중 에러가 발생하였습니다.");
	
	public final String MESSAGE;
	public final String URL;
	
	ErrorCode(String msg){
		this.MESSAGE = msg;
		this.URL = "/index/index.do";
	}
	
	ErrorCode(String msg, String url){
		this.MESSAGE = msg;
		this.URL = url;
	}
}
